mabl/ChibiOS/tools/embsysregviewdata/data/ARM_Cortex-M4/STMicroelectronics/STM32L4x3.xml
4;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#190;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#160;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#190;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8218;&#194;&#166;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#160;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#162;&#226;&#8364;&#382;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#172;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#194;&#166;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#226;&#8364;&#160;&#195;&#162;&#226;&#8218;&#172;&#226;&#8222;&#162;&#195;&#402;&#198;&#8217;&#195;&#8218;&#194;&#162;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#8218;&#194;&#172;&#195;&#402;&#226;&#8364;&#166;&#195;&#8218;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#8224;&#226;&#8364;&#8482;&#195;&#402;&#194;&#162;&#195;&#162;&#226;&#8364;&#353;&#194;&#172;&#195;&#8230;&#194;&#161;&#195;&#402;&#198;&#8217;&#195;&#162;&#226;&#8218;&#172;&#197;&#161;&#195;&#402;&#226;&#8364;&#353;&#195;&#8218;&#194;&#162;-M4
              LOCKUP (Hardfault) output enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPR</name>
          <displayName>SWPR</displayName>
          <description>SWPR</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>P31WP</name>
              <description>SRAM2 page 31 write
              protection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P30WP</name>
              <description>P30WP</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P29WP</name>
              <description>P29WP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P28WP</name>
              <description>P28WP</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P27WP</name>
              <description>P27WP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P26WP</name>
              <description>P26WP</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P25WP</name>
              <description>P25WP</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P24WP</name>
              <description>P24WP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P23WP</name>
              <description>P23WP</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P22WP</name>
              <description>P22WP</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P21WP</name>
              <description>P21WP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P20WP</name>
              <description>P20WP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P19WP</name>
              <description>P19WP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P18WP</name>
              <description>P18WP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P17WP</name>
              <description>P17WP</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P16WP</name>
              <description>P16WP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P15WP</name>
              <description>P15WP</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P14WP</name>
              <description>P14WP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P13WP</name>
              <description>P13WP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P12WP</name>
              <description>P12WP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P11WP</name>
              <description>P11WP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P10WP</name>
              <description>P10WP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P9WP</name>
              <description>P9WP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P8WP</name>
              <description>P8WP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7WP</name>
              <description>P7WP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6WP</name>
              <description>P6WP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5WP</name>
              <description>P5WP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4WP</name>
              <description>P4WP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3WP</name>
              <description>P3WP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2WP</name>
              <description>P2WP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1WP</name>
              <description>P1WP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P0WP</name>
              <description>P0WP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SKR</name>
          <displayName>SKR</displayName>
          <description>SKR</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>SRAM2 write protection key for software
              erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
